<template>
    <section class="rule-container">

        <h1>一、活动时间：</h1>
        <p>2020年8月20日00:00:00起</p>
        <div style="margin-bottom: 30px"></div>
        <h1>二、参与条件：</h1>
        <p>每位普通用户通过微信账号参与活动。</p>
        <div style="margin-bottom: 30px"></div>
        <h1>三、活动规则：</h1>
        <h2>1、签到规则</h2>
        <p>①用户在活动期间每日登录东方青创营公众号，进入“领福利”活动页面，根据提示可参加签到活动，每个用户每天可签到一次，不可补签。</p>
        <p>②本活动连续签到可获取除当日奖励外的额外奖励，若连续签到中断，则连续签到次数重新计算，已领取的连续签到额外奖励不可重复领取。</p>
        <p>③连续签到额外奖励：</p>
        <p>连续签到3天可额外获取1枚青创币。</p>
        <p>连续签到5天可额外获取2枚青创币。</p>
        <p>连续签到10天可额外获取3枚青创币。</p>
        <p>连续签到15天可额外获取4枚青创币。</p>
        <p>连续签到20天可额外获取5枚青创币。</p>
        <p>连续签到30天可额外获取价值700元新东方六级英语课程。</p>
        <p>连续签到奖品说明：用户获得连续签到奖励后，可在签到页面-“已领福利”中查看。</p>
        <div style="margin-bottom: 30px"></div>
        <h2>2、幸运抽牌规则</h2>
        <p>本次活动抽奖内容可供用户自行选择，用户选择完成后消耗1枚青创币可进行1次抽奖，单日抽奖不限制次数。</p>
        <div style="margin-bottom: 30px"></div>
        <h1>四、 奖品发放规则：</h1>
        <p>消耗青创币抽奖，用户获得指定奖品。可在“已领福利”中查看中奖信息。</p>
        <div style="margin-bottom: 30px"></div>
        <h2>1、实物奖品说明：</h2>
        <p>①发放方式： 奖品根据您提供的收货地址进行邮寄， 用户可在已领中查看和填写收货地址信息。</p>
        <p>②发放时间：活动结束后2周内安排发放。</p>
        <p>③弃奖说明： 如中奖用户在2020年X月X日前未填写中奖信息导致奖品无法配送， 视为用户放弃本次中奖资格。</p>
        <div style="margin-bottom: 30px"></div>
        <h2>2、兑换码奖品说明： </h2>
        <p>①用户抽中各品牌兑换码，用户可在“已领福利”中查看兑换码信息及使用方式。</p>
        <p>②弃奖说明： 如中奖用户在2020年X月X日前未使用兑换券导致兑换券超过有效期限， 视为用户放弃本次中奖资格。</p>
        <p>请用户中奖后保存兑换码号， 活动下线后将不提供中奖号码查询服务。</p>
        <div style="margin-bottom: 30px"></div>
        <h2>3、青创币奖品说明： </h2>
        <p>青创币奖励实时到账， 请中奖用户在“已领福利”中查看。用户现可使用青创币参与幸运抽牌活动，具体内容请查看幸运抽牌规则。</p>
        <div style="margin-bottom: 30px"></div>
        <h1>五、注意事项：</h1>
        <p>
            1、活动过程中，凡以不正当手段（如作弊领取、恶意套取、刷信誉、虚假交易、扰乱系统、实施网络攻击等）参与本次活动的用户，东方青创营有权终止其参与活动，并取消其获奖资格（如奖品已发放，东方青创营有权追回），如给东方青创营造成损失的，东方青创营将保留向违规用户继续追索的权利。</p>
        <p>
            2、如遇不可抗力(包括但不限于重大灾害事件、活动受政府机关指令需要停止举办或调整的、活动中存在大面积作弊行为、活动遭受严重网络攻击或因系统故障导致活动中奖名单大批量出错，活动不能正常进行的)，东方青创营有权取消、修改或暂停本活动。</p>
        <p>3、发放奖品前，东方青创营有权要求用户提供其身份证、护照、参与活动微信帐号等证明用户符合本活动规则的材料信息，如用户所提供的信息不真实、不完整、失效或不合法的，东方青创营可不发放奖品。</p>
        <p>4、本次活动限普通微信个人用户参与，机构、企业等不可参与，一经发现将取消其获奖资格。</p>
        <p>5、活动申诉：为了及时有效的处理您的问题，若您对活动有任何疑问，请在活动时间内进入“东方青创营-加入我们-联系营长”中及时申诉。</p>
        <p>本次活动最终解释权归东方青创营所有。</p>

    </section>
</template>

<script>
    export default {
        name: "rule",
        mounted() {
            this.$Utils.setDocumentTitle('活动规则')
        }
    }
</script>

<style lang="less" scoped>
    .rule-container {
        padding: 40px;

        h1 {
            line-height: 0;
            color: @default-font-color-title;
            font-size: @default-font-size-34;
        }

        h2 {
            font-size: @default-font-size-30;
            margin-bottom: 20px;
            text-indent: 50px;
        }

        p {
            font-size: @default-font-size-26;
            line-height: 1.4;
            color: @default-font-color-content;
            text-indent: 50px;
            margin-bottom: 20px;
        }
    }
</style>