<template>
  <div class="dashboard_container">
    <h1>个人想法和观点，以及发现的问题</h1>
    <h3>1、基线版本问题</h3>
    <p>
      <b>基线版本的定义：</b>
      基线是软件文档或源码（或其它产出物）的一个稳定版本，它是进一步开发的基础.
      所以，当基线形成后，它提供一个正式标准，随后的工作基于此标准，并且只有经过授权后才能变更这个标准。
      它是不携带任何在此基础上衍生出的个性色彩的版本
      <br>
      经过最近这段时间的阅读和查看，发现咱们的基线版本，不能称作是一版基线。
      <br>
      1、这个版本带有非常明显的个性化色彩。比如：它的版面样式、色调等。
      很明显咱们的基线版本带有浓重的个性色彩，如果在此基础上继续做开发那将会有问题，项目的成长曲线会有问题，无论从开发难度、模块化、维护上。
      <br>
      2、任何团队开发，都是在基线版本的基础上，拆出新的分支来做开发，而不是直接修改基线版本的源码。
      比如：一台雏形发动机，分别授权给了，A 、
      B两个厂商，他们肯定是在雏形机的基础上做符合他们调性的调教，而不是让提供雏形机的厂商
      帮他们做，雏形机厂商只提供雏形机，你要的任何个性东西，都是自己加上去的。
      <br>
      这是最重要的两个问题
    </p>
    <h3>2、组件的数量、复用和开发效率的问题</h3>
    <p>
      <b>组件的数量：</b> 咱们不是徒手开发，咱们的开发模式是：vue+elelmet—ui
      模式，element是一款，前端样式类的框架系统，为我们提供了很多可供直接使用的组件，
      提供的组件能满足咱们90%的开发需求。所以，咱们各个团队的前端组件库，其实都是一致的，就是说别的团队有多少前端组件，我们就有多少，
      我们有多少他们也有多少。剩下的10%，指的是如果element没有提供，各个团队之间独自开发的组件，这个是有必要共享或者讨论的。
      如果不是独自的，那就没有必要去讨论各个团队之间有多少组件可供使用，因为大家拥有的东西都是一样的。
      <br>
      <b>复用：</b>正因为大家使用的同一款前端样式类的框架，所以，自然复用就不用讨论。
      <br>
      <b>开发效率：</b>正因为大家使用的同一款前端样式类的框架，所以，如果使用默认的样式自然开发效率也不用讨论。因为直接使用无需开发。
      但是，如果要定制样式，就比如咱们上周在群里发的样式图，这种东西是需要徒手开发的，需要开发周期，但是如果一旦开发完毕，这种东西
      是可以被其他团队使用，如果他们需要的话。这就是在组件数量提到的那10%的部分。
    </p>
  </div>
</template>

<script>
export default {
  name: 'Dashboard',
  data() {
    return {}
  }
}
</script>
<style lang="scss" scoped>
.dashboard_container {
  padding: 20px 80px;
  p {
    line-height: 2;
  }
}
</style>
